// 3.2.cpp
// Суканець Олег
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами.
// Варіант 14

#include <iostream>
#include <Windows.h>
using namespace std;

int main() {
    double a, b, c, x, F;
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    // Введення значень з клавіатури
    cout << "Введіть a: ";
    cin >> a;
    cout << "Введіть b: ";
    cin >> b;
    cout << "Введіть c: ";
    cin >> c;
    cout << "Введіть x: ";
    cin >> x;

    // Спосіб 1: Розгалуження у скороченій формі
    if ((x + c) < 0 && a != 0)
        F = -a * x * x - b;
    else if ((x + c) > 0 && a == 0)
        F = (x - a) / (x - c);
    else
        F = (x / c) + (c / x);

    // Виведення результату для першого способу
    cout << endl;
    cout << "1) F1 = " << F << endl;

    // Спосіб 2: Розгалуження у повній формі
    if ((x + c) < 0) {
        if (a != 0)
            F = -a * x * x - b;
        else
            F = (x / c) + (c / x);  // Додаткове обчислення для незапланованих випадків
    }
    else if ((x + c) > 0) {
        if (a == 0)
            F = (x - a) / (x - c);
        else
            F = (x / c) + (c / x);  // Додаткове обчислення для інших випадків
    }
    else {
        F = (x / c) + (c / x);
    }

    // Виведення результату для другого способу
    cout << "2) F2 = " << F << endl;

    return 0;
}
